han-kaka/UEL020100/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/code/app/app_comm_ble.c
/**************************************************************************************************
 * @brief       返回错误代码
 * @param       command：命令
 * @param       errCode：错误代码
 * @return      None
 **************************************************************************************************
 */
static void UserReturnErrCode(uint8_t command, uint8_t errCode)
{
		uint8_t  postion = 0;
		uint8_t  *pSendbuf = char4_all_send + sizeof(ProtocolAppHeadFormat_t);
		
		pSendbuf[postion++] = errCode;
		Put_Return(command, postion);
}

/**************************************************************************************************
 * @brief       返回错误代码带数据
 * @param       command：命令
 * @param       errCode：错误代码
 * @param       pData：数据
 * @param       len：数据长度
 * @return      0-成功；other-失败；
 **************************************************************************************************
 */
static void UserReturnErrCodeAndData(uint8_t command, uint8_t errCode, char *pData, uint8_t len)
{
		uint8_t  postion = 0;
		uint8_t  *pSendbuf = char4_all_send + sizeof(ProtocolAppHeadFormat_t);
		
		pSendbuf[postion++] = errCode;
		memcpy(pSendbuf + postion, pData, len);
		postion += len;
		Put_Return(command, postion++);
}

uint8_t ProcessCommand(uint8_t *pData, uint8_t command, uint16_t dataLen)
{
		uint8_t  i, tmp;
		uint8_t  ret = 0;
		uint8_t  *pSendbuf;
		uint16_t sendLength = 0;
		#if (defined USER_FINGERMODE) && (defined USER_FINGERMODEVENA)
		uint16 temp16;
		#endif
		uint32_t tmp32;
//	static uint8  sTemp;
		static uint8_t  sReadUserCnt = 0;
		static uint8_t  sFlagAddUser = 0;
		uint8_t  buf[16];
//	static UserInfo_t tempUserInfo;
//		UTCTimeStruct *pTempTimeStruct = (UTCTimeStruct *)(buf + 6);
		LogInfo_t *pTmpLogInfo = (LogInfo_t *)buf;
	
		if (sProtocolAppFormat.headData.version != PROTOCOL_APP_VERSION)			// 判断协议头正确性
		{
				#if SEGGER_RTT_DEBUG_AES_DECODE
						SEGGER_RTT_printf(0, "PROTOCOL_APP_ERR_VERSION_1!\r\n");
				#endif
				UserReturnErrCode(command, PROTOCOL_APP_ERR_VERSION);
				return ret;
		}
		if (dataLen == 0)
		{
				#if SEGGER_RTT_DEBUG_AES_DECODE
						SEGGER_RTT_printf(0, "PROTOCOL_APP_ERR_PARAM_2!\r\n");
				#endif
				UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
				return ret;
		}
		if ((gSystemRunParam.flagInit != 0xA5) && (command != CMD_GET_AESKEY))
		{
				#if SEGGER_RTT_DEBUG_AES_DECODE
						SEGGER_RTT_printf(0, "PROTOCOL_APP_ERR_PARAM_3!\r\n");
				#endif
				UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
				return ret;
		}
		#if SEGGER_RTT_DEBUG_AES_DECODE
				SEGGER_RTT_printf(0, "command = %d\r\n",command);
		#endif
		
		switch (command)
		{
			
				case CMD_GET_HARD_INFO_VERSION:											/* 获取硬件版本信息 */
						UserReturnErrCodeAndData(command, PROTOCOL_APP_ERR_NONE, HARD_VERSION_INFO, sizeof(HARD_VERSION_INFO));
						break;
				
				case CMD_GET_SOFT_INFO_VERSION:											/* 查询软件版本信息 */
						UserReturnErrCodeAndData(command, PROTOCOL_APP_ERR_NONE, SOFT_VERSION_INFO, sizeof(SOFT_VERSION_INFO));
						break;
				
				case CMD_GET_AESKEY:													      /* 初始化 */
				{
				#if SEGGER_RTT_DEBUG_GET_AESKEY
						SEGGER_RTT_printf(0, "cmd get aeskey!\r\n");
				#endif
						
						if (*pData != 0x01)
						{
								UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
								break;
						}
						if(gSystemRunParam.flagInit == 0xA5) 
								break;
						pSendbuf = char4_all_send + sizeof(ProtocolAppHeadFormat_t);
						pSendbuf[sendLength++] = PROTOCOL_APP_ERR_NONE;
						nrf_drv_rng_rand(tempkey, 16); 
						memcpy(pSendbuf + sendLength, tempkey, 16);
						sendLength += 16;
						f_tempkey = 1;
						set_task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
				#if SEGGER_RTT_DEBUG_GET_AESKEY
						SEGGER_RTT_printf(0, "sendLength = %d!\r\n", sendLength);
				#endif
						Put_Return(command, sendLength);
						gSystemRunParam.flagInit = 0xA5;
				}
						break;
				
				case CMD_ADD_ADMIN:														/* 添加管理员 */
				case CMD_ADD_USER:														/* 添加用户 */
				{
						if (stateProcessCommand == 0)
						{
								if ((dataLen != 16) && (dataLen != 24))
								{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}
								
								if (dataLen == 16) 
								{
										sFlagAddUser = 1;
										if (UserMemCmp(pData + 8, timestamp, 8) <= 0) break;
										memcpy(timestamp, pData+8, 8);
										set_task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
								}
								else 
								{
										sFlagAddUser = 11;
										if (UserMemCmp(pData + 16, timestamp, 8) <= 0) break;
										memcpy(timestamp, pData+16, 8);
										set_task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
								}
								stateProcessCommand = 1;
								ret = 0xFF;
						}
						else if (stateProcessCommand == 1)
						{
								ret = UserAddUserInfoToSystem(sFlagAddUser, 0, pData);
								if (ret == 0)
								{
										sReadUserCnt = 0;
										UserSetCurrentUser(pData);
										UserReturnErrCodeAndData(command, PROTOCOL_APP_ERR_NONE, (char *)pData + 8, 16);
								}
								else if (ret == 0xFF)
								{
								}
								else
								{
										UserReturnErrCodeAndData(command, PROTOCOL_APP_ERR_GEN, (char *)pData + 8, 16);
								}
						}
						else 
						{
								UserReturnErrCodeAndData(command, PROTOCOL_APP_ERR_GEN, (char *)pData + 8, 16);
						}
				}
						break;
				
				case CMD_READ_USER:														/* 读取用户 */
				{
						if ((dataLen != 1) || (*pData != 0xA2))
						{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}			/* 数据长度错误，返回参数错误 */
						if (UserGetCurrentUser() == 0)
						{UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_PERMIT);break;}	/* 未登录，返回权限错误 */
						while (1)
						{
//								if (sReadUserCnt < MAX_USER_NUM)
//								{
//										if (UserReadUserInfoUID(sReadUserCnt, buf) == 0)
//										{
//											UserReturnErrCodeAndData(command, PROTOCOL_APP_ERR_NONE, (char *)buf, 8);
//											sReadUserCnt++;
//											break;
//										}
//										sReadUserCnt++;
//								}
//								else
//								{
//										UserReturnErrCode(command, PROTOCOL_APP_ERR_FINISHED);
//										break;
//								}
						}
				}
						break;
//				
//				case CMD_DEL_USER:														/* 删除用户 */
//				{
////						if (dataLen != 8)
////						{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}			/* 数据长度错误，返回参数错误 */
////						if (UserGetCurrentUser() == 0)
////						{UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_PERMIT);break;}	/* 未登录，返回权限错误 */
////						
////						UserDelUserInfoFromSystem(pData);
////						UserReturnErrCode(command, PROTOCOL_APP_ERR_NONE);
//				}	
//					break;
//				
				case CMD_USER_LOGIN:													/* 用户登录 */
				{
//						if (dataLen != 16)
//						{
//								UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
//								break;
//						}
//						
//						if (UserMemCmp(pData, timestamp, 8) <= 0) 
//								break;
//						memcpy(timestamp, pData+8, 8);
//						set_task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
//						
//						tmp = UserSearchUserInfoNumber(pData);
//						if (tmp < MAX_USER_NUM)
//						{
//								sReadUserCnt = 0;
//								UserSetCurrentUser(pData);
//								UserReturnErrCode(command, PROTOCOL_APP_ERR_NONE);
//						}
//						else
//						{
//								UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN);
//						}
				}
					break;
				
