han-kaka/UEL020100/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/code/app/app_comm_ble.c
				case CMD_SET_KEYBOARD:													/* 设置键盘密码 */
				{
						UserReturnErrCode(command, PROTOCOL_APP_ERR_VERSION);
//						if (stateProcessCommand == 0)
//						{
//							stateProcessCommand = 1;
//							ret = 0xFF;
//							
//							if (dataLen != 8)
//							{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}			/* 数据长度错误，返回参数错误 */
//							if (UserGetCurrentUser() == 0)
//							{UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_PERMIT);break;}	/* 未登录，返回权限错误 */
//						}
//						else if (stateProcessCommand == 1)
//						{
//							for (sTemp = 0; sTemp < MAX_USER_NUM; sTemp ++)
//							{
//								while (UserGetUserInfo(sTemp, &tempUserInfo) == 0xFF);
//								if ((tempUserInfo.flag & 0xC3) != 0xC2) continue;
//								if (UserMemCmp(tempUserInfo.userId, UserGetCurrentUser(), sizeof(tempUserInfo.userId)) == 0) continue;
//								if (UserMemCmp(tempUserInfo.password, pData, sizeof(tempUserInfo.password)) == 0)
//								{
//									break;
//								}
//							}
//							if (sTemp < MAX_USER_NUM)
//							{
//								stateProcessCommand = 3;
//							}
//							else
//							{
//								stateProcessCommand = 2;
//							}
//							ret = 0xFF;
//						}
//						else if (stateProcessCommand == 2)
//						{
//							ret = UserAddUserInfoToSystem(2, UserGetCurrentUser(), pData);
//							if (ret == 0)
//							{
//								UserReturnErrCode(command, PROTOCOL_APP_ERR_NONE);
//							}
//							else if (ret == 0xFF)
//							{
//								
//							}
//							else
//							{
//								UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN);
//							}
//						}
//						else if (stateProcessCommand == 3)
//						{
//							osal_memset(buf, 0, 8);
//							ret = UserAddUserInfoToSystem(2, tempUserInfo.userId, buf);
//							if (ret == 0)
//							{
//								UserReturnErrCode(command, PROTOCOL_APP_ERR_PASSWORD_SAME);
//							}
//							else if (ret == 0xFF)
//							{
//								
//							}
//							else
//							{
//								UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN);
//							}
//						}
				}
						break;
				
				case CMD_ADD_PERIPHERAL:												/* 添加外设 */
				{
						UserReturnErrCode(command, PROTOCOL_APP_ERR_VERSION);
					
//						if (dataLen != 1)
//						{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}			/* 数据长度错误，返回参数错误 */
//						if (UserGetCurrentUser() == 0)
//						{UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_PERMIT);break;}	/* 未登录，返回权限错误 */
//						tmp = UserSearchUserInfoNumber(UserGetCurrentUser());
//						if (tmp >= MAX_USER_NUM)
//						{UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_PERMIT);break;}
//						if (*pData == 1)
//						{
//							#if (defined USER_FINGERMODE) && (!(defined USER_FINGERMODEVENA))
//							if (UserFingerModuleAddition(tmp, UserFingerAdditionCallback) == FALSE)
//							{
//								UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN);
//								break;
//							}
//							#else
//							UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
//							UserSoundFailuer();
//							break;
//							#endif
//						}
//						else if (*pData == 2)
//						{
//							#ifdef USER_ICCARD
//							if (UserICCardAddition(UserGetCurrentUser()) == FALSE)
//							{
//								UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN);
//								break;
//							}
//							#else
//							UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
//							UserSoundFailuer();
//							break;
//							#endif
//							
//						}
//						else if (*pData == 4)
//						{
//							#if (defined USER_FINGERMODE) && (defined USER_FINGERMODEVENA)
//							if (UserFingerModuleAddition(tmp, UserFingerAdditionCallback) == FALSE)
//							{
//								UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN);
//								break;
//							}
//							#else
//							UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
//							UserSoundFailuer();
//							break;
//							#endif
//						}
//						else
//						{
//							UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
//							UserSoundFailuer();
//							break;
//						}
//						UserReturnErrCode(command, PROTOCOL_APP_ERR_NONE);
				}
						break;
					
				case CMD_SWITCH:														/* 开关指令 */
				{
						#if SEGGER_RTT_DEBUG_SWITCH
								SEGGER_RTT_printf(0, "cmd switch!\r\n");
						#endif
					
						if (dataLen != 9)
						{
								UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
								break;
						}
						
						if (UserMemCmp(pData, timestamp, 8) <= 0) 
								break;
						memcpy(timestamp, pData, 8);
						set_task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
						
						pSendbuf = char4_all_send + sizeof(ProtocolAppHeadFormat_t);
						pSendbuf[sendLength ++] = PROTOCOL_APP_ERR_NONE;
						pSendbuf[sendLength ++] = gSystemRunParam.batterPercent;
						tmp = 0;
						if (gFlagAdjustTime <= 1) 
						{
								tmp |= BV(0);
						}
//						if (UserGetLogInfo(0) == 1) 
//						{
//								tmp |= BV(1);
//						}
						pSendbuf[sendLength ++] = tmp;
						Put_Return(command, sendLength);
						if (pData[8] == 0xA1)
						{
								Motor_State_Struct = INVERSION;
								task_flag_struct.motordelay = ENABLE;
						}
						else if (pData[8] == 0xA2)
						{
								Motor_State_Struct = FOREWARD;
								task_flag_struct.motordelay = ENABLE;
						}
				}
						break;
				
				case CMD_ADJUST_TIME:													/* 校时指令 */
				{
						#if SEGGER_RTT_DEBUG_ADJUST_TIME
								SEGGER_RTT_printf(0, "cmd adjust time!\r\n");
						#endif
					
						#if PROTOCOL_APP_VERSION == 0x0100
			/****************************** V1.0 版本程序开始 *****************************/
						if (dataLen != 4)
						{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}			/* 数据长度错误，返回参数错误 */
						//if (UserGetCurrentUser() == 0)
						//{UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_PERMIT);break;}	/* 未登录，返回权限错误 */
						tmp32 = pData[0];
						tmp32 = (tmp32 << 8) | pData[1];
						tmp32 = (tmp32 << 8) | pData[2];
						tmp32 = (tmp32 << 8) | pData[3];
			/****************************** V1.0 版本程序结束 *****************************/
						#else
			/****************************** V1.1 版本程序开始 *****************************/
						if (dataLen != 12)
						{
								UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
								break;
						}			/* 数据长度错误，返回参数错误 */
						
						if (UserMemCmp(pData, timestamp, 8) <= 0) 
								break;
						memcpy(timestamp, pData, 8);
						set_task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
						
