han-kaka/UEL020100/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/code/app/app_comm_ble.c
						tmp32 = pData[8];
						tmp32 = (tmp32 << 8) | pData[9];
						tmp32 = (tmp32 << 8) | pData[10];
						tmp32 = (tmp32 << 8) | pData[11];
			/****************************** V1.1 版本程序结束 *****************************/
						#endif
						
						if (tmp32 < SECONDS2000YEAR)
						{
								UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
								break;
						}
						tmp32 -= SECONDS2000YEAR;
						seconds_times = tmp32;
//						set_clock(tmp32);
//						osal_ConvertUTCTime( pTempTimeStruct, tmp32 );
//						buf[0] = pTempTimeStruct->year - 2000;
//						buf[1] = pTempTimeStruct->month + 1;
//						buf[2] = pTempTimeStruct->day + 1;
//						buf[3] = pTempTimeStruct->hour;
//						buf[4] = pTempTimeStruct->minutes;
//						buf[5] = pTempTimeStruct->seconds;
//						UserSetPCF8563Hex(buf);
						gFlagAdjustTime = 60000; /* 大约一周时间 */
						UserReturnErrCode(command, PROTOCOL_APP_ERR_NONE);
				}
						break;
				
				case CMD_READ_LOG:														/* 读取日志 */
				{
						pSendbuf = char4_all_send + sizeof(ProtocolAppHeadFormat_t);
						if (UserGetLogInfo(pTmpLogInfo) == 1)
						{
								pSendbuf[sendLength ++] = PROTOCOL_APP_ERR_NONE;
								memcpy(pSendbuf + sendLength, pTmpLogInfo->userId, sizeof(pTmpLogInfo->userId));
								sendLength += sizeof(pTmpLogInfo->userId);
								pTmpLogInfo->time += SECONDS2000YEAR;
								pSendbuf[sendLength ++] = pTmpLogInfo->time >> 24;
								pSendbuf[sendLength ++] = pTmpLogInfo->time >> 16;
								pSendbuf[sendLength ++] = pTmpLogInfo->time >> 8;
								pSendbuf[sendLength ++] = pTmpLogInfo->time >> 0;
								pSendbuf[sendLength ++] = pTmpLogInfo->action;
						}
						else 
						{
								pSendbuf[sendLength ++] = PROTOCOL_APP_ERR_FINISHED;
								memset(pSendbuf + sendLength, 0, 13);
								sendLength += 13;
						}
						
						Put_Return(command, sendLength);
				}
						break;
			
				case CMD_READ_USER_CONFIG:												/* 读取用户信息 */
				{
						if ((dataLen != 1) || (*pData != 0xAB))
						{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}			/* 数据长度错误，返回参数错误 */
						if (UserGetCurrentUser() == 0)
						{UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_PERMIT);break;}	/* 未登录，返回权限错误 */
						
						if (UserReadUserInfoConfig(UserGetCurrentUser(), &tmp) == 0)
						{
							buf[0] = 0; buf[1] = 0;
							if (tmp & 0x40) buf[1] |= 0x01;
							if (tmp & 0x20) buf[1] |= 0x02;
							if (tmp & 0x10) buf[1] |= 0x04;
							if (tmp & 0x08) buf[1] |= 0x08;
							UserReturnErrCodeAndData(command, PROTOCOL_APP_ERR_NONE, (char *)buf, 2);
						}
						
						while (1)
						{
								if (sReadUserCnt < MAX_USER_NUM)
								{
										Rom_Data_Type user_info_data_struct;
										p_Rom_Data_Type p_user_info_data_struct = &user_info_data_struct;	
										
										if (UserReadUserInfoUID(sReadUserCnt, buf, p_user_info_data_struct) == 0)
										{
												UserReturnErrCodeAndData(command, PROTOCOL_APP_ERR_NONE, (char *)buf, 8);
												sReadUserCnt++;
												break;
										}
										sReadUserCnt++;
								}
								else
								{
										UserReturnErrCode(command, PROTOCOL_APP_ERR_FINISHED);
										break;
								}
						}
				}
						break;
				
				case CMD_DEL_LOG:														/* 删除日志 */
				{
						//	if (dataLen != 16)
						//	{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}			/* 数据长度错误，返回参数错误 */
							memcpy(pTmpLogInfo->userId, pData, sizeof(pTmpLogInfo->userId));
							tmp32 = pData[sizeof(pTmpLogInfo->userId) + 0];
							tmp32 = (tmp32 << 8) | pData[sizeof(pTmpLogInfo->userId) + 1];
							tmp32 = (tmp32 << 8) | pData[sizeof(pTmpLogInfo->userId) + 2];
							tmp32 = (tmp32 << 8) | pData[sizeof(pTmpLogInfo->userId) + 3];
							pTmpLogInfo->time = tmp32 - SECONDS2000YEAR;
							if (UserDelLogInfo(pTmpLogInfo) == 1)
							{
									UserReturnErrCode(command, PROTOCOL_APP_ERR_NONE);
							}
							else 
							{
									UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN);
							}
					}
							break;
					
				case CMD_FACTORYRESET:													/* 恢复出厂设置 */
				{
						if (dataLen != 129)
						{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}
						if (pData[8] != 0xAA)
						{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}
//						UserGetAppData(P_EE_ADDR_TIMESTAMP, buf);
						if (UserMemCmp(pData, buf, 8) <= 0) break;
//						UserSaveAppData(P_EE_ADDR_TIMESTAMP, pData);
//						UserReturnErrCode(command, PROTOCOL_APP_ERR_NONE);
//						UserClearUserInfoFromSystem();
//						gSystemRunParam.flagInit = 0x00;									// 清除管理员及密码
//						SaveSetup();														// 保存数据
//						Save_SysRunState(1);												// 添加管理员模式
//						WaitSystemExit(0, 20000);
//						ChangescanRspData(sizeof ( lockinitname ), (uint8*)lockinitname);	// 初始化广播名字
//						UserSaveAppData(P_EE_ADDR_LOCKNAME, (uint8*)lockinitname);			// update to EEPROM
//						UserStartAdv(1, 0);													// 立即开始广播
//						UserSoundSuccess();
				}
						break;
				
				case CMD_TERFILEDATA:													/* 写设备文件数据 */
				{
				#if (defined USER_FINGERMODE) && (defined USER_FINGERMODEVENA)
						temp16 = pData[0];
						temp16 = (temp16 << 8) | pData[1]; /* 读取包序号 */
						if (temp16 == 0) /* 文件信息 */
						{
							if (pData[2] != 1)  /* 判断指纹数据 */
							{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}
							tmp32 = pData[3];
							tmp32 = (tmp32 << 8) | pData[4];
							tmp32 = (tmp32 << 8) | pData[5];
							tmp32 = (tmp32 << 8) | pData[6]; /* 读取文件长度 */
							sTransferFile.dataLength = tmp32;
							tmp32 = pData[7];
							tmp32 = (tmp32 << 8) | pData[8];
							tmp32 = (tmp32 << 8) | pData[9];
							tmp32 = (tmp32 << 8) | pData[10]; /* 读取文件累加和 */
							sTransferFile.dataSum = tmp32;
							
							tmp = UserSearchUserInfoNumber(pData + 11);
							if (tmp >= MAX_USER_NUM)
							{UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN); break;}
							
							UserGetAppData(P_EE_ADDR_TIMESTAMP, buf);
			//				if (UserMemCmp(pData + 19, buf, 8) <= 0) break;
							UserSaveAppData(P_EE_ADDR_TIMESTAMP, pData + 19);
							
							UserFingerModuleAddUserDataStart(tmp, sTransferFile.dataLength, UserTransferFileCallback);
						}
						else if (temp16 == 0xFFFF) /* 传输完成 */
						{
							UserFingerModuleAddUserDataEnd(0xFFFF, sTransferFile.dataSum);
						}
						else /* 文件数据 */
						{
							if (sTransferFile.currentNum != temp16)
							{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}
							UserFingerModuleAddUserDataIng(temp16, pData + 2);
						}
				#else
						UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN);
				#endif
				}
						break;
				
				case CMD_PARAM_CONFIG:													/* 参数配置指令 */
				{
						if (dataLen < 9)
						{
								UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
								break;
						}
						
						if (UserMemCmp(pData, timestamp, 8) <= 0) 
								break;
						memcpy(timestamp, pData, 8);
						set_task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
						
						if (pData[8] == 0x01)	// 配置开锁方向
						{
								if ((pData[9] == 0x01) || pData[9] == 0x02)
								{
										memcpy(&open_lock_dir, pData+9, 1);
										set_task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
										UserReturnErrCode(command, PROTOCOL_APP_ERR_NONE);
//										SC_ProtocolOpenLockDir(pData[9]);
								}
								else
								{
										UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
								}
						}
						else if (pData[8] == 0x10)	// 配置IP地址和端口号
						{
								memcpy(NB_NetPar.ServerIP, pData+9, SERVER_IP_LEN);
								set_task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
								UserReturnErrCode(command, PROTOCOL_APP_ERR_NONE);
						}
						else if (pData[8] == 0x11)	// 配置APN
						{
								memcpy(NB_NetPar.ServerAPN, pData+9, SERVER_APN_LEN);
								set_task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
								UserReturnErrCode(command, PROTOCOL_APP_ERR_NONE);
						}
						else
						{
							UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
						}
				}
						break;
					
				case CMD_PARAM_READ:													/* 参数读取指令 */
				{
						if (dataLen < 9)
						{
								UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
								break;
						}
						if (UserMemCmp(pData, timestamp, 8) <= 0) 
								break;
						memcpy(timestamp, pData, 8);
						set_task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
					
						if (pData[8] == 0x12)	// 参数IMEI
						{
								if (gSystemRunParam.flagAny & 0x01)
								{
										i = 0;
										pSendbuf = char4_all_send + sizeof(ProtocolAppHeadFormat_t);
										pSendbuf[i++] = PROTOCOL_APP_ERR_NONE;		
										memcpy(pSendbuf + i, NB_CommPacket.Init_Data.imei, IMEI_LEN);
										tmp = SC_StrPrintlen(pSendbuf + i) % 17;
										pSendbuf[i + tmp] = 0; i ++;
										i += tmp;
										Put_Return(command, i);
								}
								else
								{
										UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_FOUND_NB);
								}
						}
						else if (pData[8] == 0x13)	// ICCID
						{
								if (gSystemRunParam.flagAny & 0x02)
								{
										i = 0;
										pSendbuf = char4_all_send + sizeof(ProtocolAppHeadFormat_t);
										pSendbuf[i++] = PROTOCOL_APP_ERR_NONE;
										memcpy(pSendbuf + i, NB_CommPacket.Init_Data.iccid, ICCID_LEN);									
										tmp = SC_StrPrintlen(pSendbuf + i) % 33;
										pSendbuf[i + tmp] = 0; i ++;
										i += tmp;
										Put_Return(command, i);
								}
								else
								{
										UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_FOUND_SIM);
								}
						}
						else
						{
								UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
						}
				}
						break;
				
				default:
						UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
						break;
		}
		
		if (ret == 0xFF)
		{
			
		}
		else
		{
				stateProcessCommand = 0;
		}
		
		return ret;
}


